porousVent/grillcases/grill_fanPressure/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantBoussinesqSimpleFoam; 

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          0.03;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

libs
(
    "libturbulenceDerivedFvPatchFields.so"
    "libincompressibleTurbulenceModel.so"
    "libincompressibleRASModels.so"
    "libswakTopoSources.so"
    "libgroovyBC.so"
);


/*functions
{
    rack_inlet_temp
    {
        type patchExpression;
        accumulations (
            average
        );
        patches (
	    "rack*_inlet"
        );
        expression "phi";
        verbose true;
	outputControlmode   timeStep;
	outputInterval  1;
    }*/
};


// ************************************************************************* //
