porousVent/grillcases/grill_fanPressure/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (3 0 0)
    (3 0.6 0)
    (0 0.6 0)
    (0 0 0.6)
    (3 0 0.6)
    (3 0.6 0.6)
    (0 0.6 0.6)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 10 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    frontAndBack
    {
        type wall;
        faces
        (
            (0 1 2 3)
	    (4 5 6 7)
        );
    }
    topAndBottom
    {
        type wall;
        faces
        (
            (3 2 6 7)
	    (0 1 5 4)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
