porousVent/grillcases/grill_fanPressure/constant/fanCurve

// ---------------------------------------------------------------------//


12 // 12 points in the table
(
(0.21	0.4)//(velocity pressure_jump)
(0.22	0.55)
(0.39	1.5)
(0.44	2)
(0.65	4.6)
(0.66	4.7)
(0.87	8.2)
(1.31	19)
(1.74	32.7)
(2.18	51)
(2.63	74.7)
(2.74	81.35)
);

// -------------------------------------------------------------------------------------------- //
