porousVent/grillcases/grill_fanPressure/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    frontAndBack
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    topAndBottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0.88 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }

/*    porousbaffle_master
    {
        type            flowRateInletVelocity;     
     	flowRateExpression "0";
	flowRate        swak { 
            expression  "72*area()"; // incoming volume flow rate from inlet based on mean inlet velocity 
            valueType 	patch;
            patchName 	porousbaffle_master;
        };
     	value           uniform (0 0 0);
    } 

    porousbaffle_slave
    {
       	type            flowRateInletVelocity;
       	flowRateExpression "0";
	flowRate 	swak { 
            variables 	"area1{porousbaffle_master}=area();"; 
            expression 	"72*area1"; // volume flow going out of domain from master
            valueType 	patch;
            patchName 	porousbaffle_slave;
	};
    	value           uniform (0 0 0);
    }*/
}

// ************************************************************************* //
